import i18n from 'i18next';
import { initReactI18next } from 'react-i18next';
import LanguageDetector from 'i18next-browser-languagedetector';

i18n
  .use(LanguageDetector)
  .use(initReactI18next)
  .init({
    debug: true,
    fallbackLng: 'ua',
    interpolation: {
      escapeValue: false, // not needed for react as it escapes by default
    },
    resources: {
      ru: {
        translation: {
          description:{
          ////main text
         
           "btnText":"Xочу на Интесив",
           "AnnName":"Анна Бурнышева",
           ///block  hero
           "titleHero":"Интенсив",
           "subTitleHero":'"Полноценное питание"',
           "descriptionHero":"Похудение может быть вкусным, без подсчёта калорий и изнуряющих ограничений",
           "descriptionSloganHero":"Рациональное питание+базовые упражнения для тонуса в виде зарядки или полноценной тренировки",
            ///blcok AboutIntensive 
            "aboutIntensiveTitle":"Как проходит интенсив",
            "aboutTextFirst":"Нажимая на кнопку “Хочу на Интенсив” вы попадаете на канал в телеграм к моему боту помощнику;",
            "aboutTextSecond":"Бот поможет вам с оплатой, отправит реквизиты и после оплаты добавит вас на канал Иненсива, где я лично вас встречу;",
            "aboutTextTheerd":"На канале Интенсива информация о программе, меню, упраджнения, рекомендации и ежедневная информация от меня в живом формате - посты или аудио файлы, не запись;",
            "aboutTextFourth":"Вам будет комфортно и приятно проходить программу, для меня это приоритет номер один.",
           ///reviews
           "reviewsTitle":"Более пяти тысяч человек прошли мои программы ",
           
            ///block effective
           "effectiveTitle": "Почему мои программы такие эффективные:",
           "mainEffectsFirstDescription":"Опыт работы более 10 лет и постоянная обратная связь от участников программ позволяют мне максимально точно увидеть и закрыть потребности в области снижения веса и рационального питания;",
           "mainEffectsSecondDescription":"Я знаю что все мы уникальны и мой метод предполагает разные варианты режимов - двух, трех, четырех разовый. Вы работаете в комфортном для вас режиме. На Интенсиве не нужно рано завтракать если вы обычно не завтракаете;",
           "mainEffectsTheedDescription":"Тарелки составляем таким образом чтобы было вкусно и сытно, при этом я вам расскажу как понять подходят вам эти продукты и сочетания или нет. Покажу вам как диагностировать себя через еду;",
           "mainEffectsForthDescription":"Кто не любит физ упражнения, после моих Интенсивов начинает регулярно заниматься. Я расскажу зачем и для чего нужно делать упражнения и это вовсе не про попу орехом. Вы с удовольствием начнёте делать зарядку и ждать времени когда нужно позаниматься;",
           "mainEffectsFivesDescription":"Через меня прошло более 5000 человек и я знаю как прийти к красивому здоровому телу без мучений и ограничений, в удовольствие;",
           "mainEffectsSixDescription":"Мы идём к результату не через силу воли, а учимся максимально расслабляться в процессе, позволять себе разнообразную еду, а не запрещать и получаем отличные результаты.",
           ////block information
           "successInformTitle":"Для кого этот Интенсив",
           "successInformTextFirst":"Для тех кто хочет взбодриться и войти в режим",
           "successInformTextSecond":"Для тех у кого есть лишний вес",
           "successInformTextThird":"Для тех кто хочет делать зарядку в удовольствие и адекватно питаться",
           "successInformTextFourth":"Для тех кто хочет войти в режим полноценного питания",
           "cancelInformTitle":"Кому не подходит*",
           "cancelInformeTextFirst":"Беременным",
           "cancelInformTextSecond":"Людям с диабетом 1 типа",
           "cancelInformTextThird":"Людям с тяжелыми сердечно-сосудистыми заболеваниями",
           "informationDescription":"Если у вас есть какие либо заболевания, проконсультируйтесь с врачом перед стартом",
           "informationSubdescription":"Ваш тренер по питанию и автор методики",
           ///blcok About 
           "aboutTitle":"Я, Бурнышева Анна, тренер по питанию.",
           "abouTextFirst":"Работаю в этой теме уже 10 лет.",
           "abouTextSecond":"Мои программы прошло более 5000 человек из разных уголков мира.",
           "abouTextTheerd":"Я за индивидуальный и здоровый подход, без фанатизма.",
          //  "abouTextFourth":"Работаю только по своей методике.Эффективность программ доказана тысячами отзывов и результатов.Люблю индивидуальный подход и качественную проработку привычек.Опустили руки — значит вам точно ко мне.Мой девиз «Всё в удовольствие",
           /////block FAQ
           "FaqTitile":"Вопросы:",
           "FagQuestingsFirstQuesting":"Если есть вопросы, куда писать?",
           "FagQuestingsFirstAnswer":"Ловите ссылку на мой телеграмм",
           "FagQuestingsFirstAnswerLink":"Жми сюди",
           "FagQuestingsSecondQuesting":"Можно ли тем кто на ГВ?",
           "FagQuestingsSecondAnswer":"Перед стартом напишите мне, я вам подскажу как вам лучше пройти Интенсив",
           "FagQuestingsTheerdQuesting":"Если у меня болят колени или спина?",
           "FagQuestingsTheersAnswer":"Вы можете делать то, что позволяет вам ваше тело - пресс или упражнения на руки И проконсультируйтесь с врачом перед стартом",
           "FagQuestingsFourthQuesting":"Нужно готовить сложные блюда?",
           "FagQuestingsFourthAnswer":"Я за быстроту и простоту. Меню подразумевает многовариантность и конструктор. Вы всегда сможете подобрать для себя подходящий вам вариант",
           "RevieswsTitle":"Отзывы учасников марафона:",
           ////block footer
           "FooterTitle":"Я в Инсте",
           "FooterSubTitle":"Я в Телеграме",
           "PolisyConf":"Политика конфидыциальности",
           "PublickOffert":"Публичний договор оффёрта",
           "coppywritingText":"Все права защищены",
          },
         
        }
      },
      ua: {
        translation: {
          description:{
                ////main text
            "btnText":"Xочу на Інтесив",
            "AnnName":"Анна Бурнишева",
             ///block  hero
             "titleHero":"Інтенсив",
            "subTitleHero":"'Повноцінне харчування'",
            "descriptionHero":"Схуднення може бути смачним, без підрахунку калорій і виснажливих обмежень",
            "descriptionSloganHero":"Раціональне харчування+базові вправи для тонусу у вигляді зарядки або повноцінного тренування",
             ///blcok AboutIntensive 
            "aboutIntensiveTitle":"Як проходить інтенсив",
            "aboutTextFirst":"Натискаючи на кнопку 'Хочу на Інтенсив', ви потрапляєте на канал у телеграм до мого бота помічника; ",
            "aboutTextSecond":"Бот допоможе вам з оплатою, надішле реквізити і після оплати додасть вас на канал Інтенсиву, де я особисто вас зустріну;",
            "aboutTextTheerd":"На каналі Інтенсиву інформація про програму, меню, вправи, рекомендації та щоденна інформація від мене в живому форматі - пости або аудіофайли, не запис;",
            "aboutTextFourth":"Вам буде комфортно і приємно проходити програму, для мене це пріоритет номер один.",
             ///reviews
           "reviewsTitle":"Більше п'яти тисяч людей прошли мої програми ",
            ///block effective
            "effectiveTitle": "Чому мої програми такі ефективні:",
            "mainEffectsFirstDescription":"Досвід роботи понад 10 років і постійний зворотний зв'язок від учасників програм дають мені змогу максимально точно побачити і закрити потреби в галузі зниження ваги і раціонального харчування;",
            "mainEffectsSecondDescription":"Я знаю, що всі ми унікальні і мій метод передбачає різні варіанти режимів - двох, трьох, чотирьох разовий. Ви працюєте в комфортному для вас режимі. На Інтенсиві не потрібно рано снідати, якщо ви зазвичай не снідаєте;",
            "mainEffectsTheedDescription":"Тарілки складаємо таким чином, щоб було смачно і ситно, водночас я вам розповім, як зрозуміти, підходять вам ці продукти і поєднання чи ні. Покажу вам як діагностувати себе через їжу;",
            "mainEffectsForthDescription":"Хто не любить фізичні вправи, після моїх Інтенсивів починає регулярно займатися. Я розповім навіщо і для чого потрібно робити вправи і це зовсім не про попу горіхом. Ви із задоволенням почнете робити зарядку і чекати часу, коли потрібно позайматися;",
            "mainEffectsFivesDescription":"Через мене пройшло понад 5000 осіб і я знаю як прийти до красивого здорового тіла без мук і обмежень, в задоволення;",
            "mainEffectsSixDescription":"Ми йдемо до результату не через силу волі, а вчимося максимально розслаблятися у процесі, дозволяти собі різноманітну їжу, а не забороняти та отримуємо відмінні результати.",   
            ////block information
            "successInformTitle":"Для кого цей Інтенсив",
            "successInformTextFirst":"Для тих хто хоче підбадьоритися і увійти в режим",
            "successInformTextSecond":"Для тих у кого є зайва вага",
            "successInformTextThird":"Для тих хто хоче робити зарядку в задоволення і адекватно харчуватися",
            "successInformTextFourth":"Для тих, хто хоче увійти в режим повноцінного харчування",
            "cancelInformTitle":"Кому не підходить*",
            "cancelInformeTextFirst":"Вагітним",
            "cancelInformTextSecond":"Людям із діабетом 1 типу",
            "cancelInformTextThird":"Людям із важкими серцево-судинними захворюваннями",
            "informationDescription":"Якщо у вас є якісь захворювання, проконсультуйтеся з лікарем перед стартом",
            "informationSubdescription":"Ваш тренер з харчування та автор методики",
             ///blcok About 
           "aboutTitle":"Я,Бурнишева Анна,тренер з харчування.",
           "abouTextFirst":"Працюю у цій темі вже 10 років.",
           "abouTextSecond":"Мої програми пройшло понад 5000 людей із різних куточків світу.",
           "abouTextTheerd":"Я за індивідуальний та здоровий підхід, без фанатизму.",
             /////block FAQ
            "FaqTitile":"Запитання:",
            "FagQuestingsFirstQuesting":"Якщо є питання, куди писати?",
            "FagQuestingsFirstAnswer":"Ловіть посилання на мій телеграм ",
            "FagQuestingsFirstAnswerLink":"Тисни сюди",
            "FagQuestingsSecondQuesting":"Чи можна тим хто на ГВ?",
            "FagQuestingsSecondAnswer":"Перед стартом напишіть мені, я вам підкажу як вам краще пройти Інтенсив",
            "FagQuestingsTheerdQuesting":"Якщо у мене болять коліна або спина?",
            "FagQuestingsTheersAnswer":"Ви можете робити те, що дозволяє вам ваше тіло - прес або вправи на руки. І проконсультуйтеся з лікарем перед стартом",
            "FagQuestingsFourthQuesting":"Потрібно готувати складні страви?",
            "FagQuestingsFourthAnswer":"Я за швидкість і простоту. Меню передбачає багатоваріантність і конструктор. Ви завжди зможете підібрати для себе відповідний вам варіантЯ за швидкість і простоту. Меню передбачає багатоваріантність і конструктор. Ви завжди зможете підібрати для себе відповідний вам варіант",
            "RevieswsTitle":"Відгуки учасників марафону:",
             ////block footer
            "FooterTitle":"Я в Інсті",
            "FooterSubTitle":"Я в Телеграмі",
            "PolisyConf":"Політика конфедиційності",
            "PublickOffert":"Публічний угода оферта",
            "coppywritingText":"Всі права захищенні"
          },
            
        }
      }
    }
  });

export default i18n;